## Plan Result (prod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 3 to change, 11 to destroy.</code></pre>

* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_flexible_server.atlassian-flex-server
* Delete
  * azurerm_backup_policy_vm.vm-backup-policy
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-confluence-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-confluence-04&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-crowd-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-gluster-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-gluster-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-gluster-03&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-jira-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-jira-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-prod-jira-03&#34;]
  * azurerm_recovery_services_vault.rsv




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-FLEX-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-FLEX-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway"
        name                              = "atlassian-prod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_backup_policy_vm.vm-backup-policy will be destroyed
  # (because azurerm_backup_policy_vm.vm-backup-policy is not in configuration)
  - resource "azurerm_backup_policy_vm" "vm-backup-policy" {
      - id                             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy" -> null
      - instant_restore_retention_days = 2 -> null
      - name                           = "atlassian-prod-vm-backup-policy" -> null
      - policy_type                    = "V1" -> null
      - recovery_vault_name            = "atlassian-prod-rsv" -> null
      - resource_group_name            = "atlassian-prod-rg" -> null
      - timezone                       = "UTC" -> null

      - backup {
          - frequency     = "Daily" -> null
          - hour_duration = 0 -> null
          - hour_interval = 0 -> null
          - time          = "02:30" -> null
          - weekdays      = [] -> null
        }

      - retention_daily {
          - count = 10 -> null
        }

      - retention_monthly {
          - count             = 7 -> null
          - days              = [] -> null
          - include_last_days = false -> null
          - weekdays          = [
              - "Sunday",
            ] -> null
          - weeks             = [
              - "First",
              - "Last",
            ] -> null
        }

      - retention_weekly {
          - count    = 42 -> null
          - weekdays = [
              - "Sunday",
            ] -> null
        }

      - retention_yearly {
          - count             = 77 -> null
          - days              = [] -> null
          - include_last_days = false -> null
          - months            = [
              - "January",
            ] -> null
          - weekdays          = [
              - "Sunday",
            ] -> null
          - weeks             = [
              - "Last",
            ] -> null
        }
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-confluence-02"] will be destroyed
  # (because azurerm_backup_protected_vm.vm-backup is not in configuration)
  - resource "azurerm_backup_protected_vm" "vm-backup" {
      - backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy" -> null
      - id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-confluence-02/protectedItems/VM;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-confluence-02" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "atlassian-prod-rsv" -> null
      - resource_group_name = "atlassian-prod-rg" -> null
      - source_vm_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-confluence-02" -> null
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-confluence-04"] will be destroyed
  # (because azurerm_backup_protected_vm.vm-backup is not in configuration)
  - resource "azurerm_backup_protected_vm" "vm-backup" {
      - backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy" -> null
      - id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-confluence-04/protectedItems/VM;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-confluence-04" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "atlassian-prod-rsv" -> null
      - resource_group_name = "atlassian-prod-rg" -> null
      - source_vm_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-confluence-04" -> null
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-crowd-01"] will be destroyed
  # (because azurerm_backup_protected_vm.vm-backup is not in configuration)
  - resource "azurerm_backup_protected_vm" "vm-backup" {
      - backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy" -> null
      - id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-crowd-01/protectedItems/VM;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-crowd-01" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "atlassian-prod-rsv" -> null
      - resource_group_name = "atlassian-prod-rg" -> null
      - source_vm_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-crowd-01" -> null
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-gluster-01"] will be destroyed
  # (because azurerm_backup_protected_vm.vm-backup is not in configuration)
  - resource "azurerm_backup_protected_vm" "vm-backup" {
      - backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy" -> null
      - id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-gluster-01/protectedItems/VM;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-gluster-01" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "atlassian-prod-rsv" -> null
      - resource_group_name = "atlassian-prod-rg" -> null
      - source_vm_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-01" -> null
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-gluster-02"] will be destroyed
  # (because azurerm_backup_protected_vm.vm-backup is not in configuration)
  - resource "azurerm_backup_protected_vm" "vm-backup" {
      - backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy" -> null
      - id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-gluster-02/protectedItems/VM;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-gluster-02" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "atlassian-prod-rsv" -> null
      - resource_group_name = "atlassian-prod-rg" -> null
      - source_vm_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-02" -> null
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-gluster-03"] will be destroyed
  # (because azurerm_backup_protected_vm.vm-backup is not in configuration)
  - resource "azurerm_backup_protected_vm" "vm-backup" {
      - backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy" -> null
      - id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-gluster-03/protectedItems/VM;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-gluster-03" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "atlassian-prod-rsv" -> null
      - resource_group_name = "atlassian-prod-rg" -> null
      - source_vm_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-gluster-03" -> null
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-jira-01"] will be destroyed
  # (because azurerm_backup_protected_vm.vm-backup is not in configuration)
  - resource "azurerm_backup_protected_vm" "vm-backup" {
      - backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy" -> null
      - id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-jira-01/protectedItems/VM;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-jira-01" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "atlassian-prod-rsv" -> null
      - resource_group_name = "atlassian-prod-rg" -> null
      - source_vm_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-jira-01" -> null
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-jira-02"] will be destroyed
  # (because azurerm_backup_protected_vm.vm-backup is not in configuration)
  - resource "azurerm_backup_protected_vm" "vm-backup" {
      - backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy" -> null
      - id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-jira-02/protectedItems/VM;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-jira-02" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "atlassian-prod-rsv" -> null
      - resource_group_name = "atlassian-prod-rg" -> null
      - source_vm_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-jira-02" -> null
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-prod-jira-03"] will be destroyed
  # (because azurerm_backup_protected_vm.vm-backup is not in configuration)
  - resource "azurerm_backup_protected_vm" "vm-backup" {
      - backup_policy_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupPolicies/atlassian-prod-vm-backup-policy" -> null
      - id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-jira-03/protectedItems/VM;iaasvmcontainerv2;atlassian-prod-rg;atlassian-prod-jira-03" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "atlassian-prod-rsv" -> null
      - resource_group_name = "atlassian-prod-rg" -> null
      - source_vm_id        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-prod-jira-03" -> null
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "d309fbf5-9c92-470f-a11a-f307cf73fd00"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "d309fbf5-9c92-470f-a11a-f307cf73fd00"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
        name                            = "atlasssian-prod-kv"
        tags                            = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-prod-flex-server"
        name                              = "atlassian-prod-flex-server"
        tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (18 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_recovery_services_vault.rsv will be destroyed
  # (because azurerm_recovery_services_vault.rsv is not in configuration)
  - resource "azurerm_recovery_services_vault" "rsv" {
      - classic_vmware_replication_enabled = false -> null
      - cross_region_restore_enabled       = false -> null
      - id                                 = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-prod-rsv" -> null
      - immutability                       = "Disabled" -> null
      - location                           = "uksouth" -> null
      - name                               = "atlassian-prod-rsv" -> null
      - public_network_access_enabled      = true -> null
      - resource_group_name                = "atlassian-prod-rg" -> null
      - sku                                = "Standard" -> null
      - soft_delete_enabled                = true -> null
      - storage_mode_type                  = "GeoRedundant" -> null
      - tags                               = {
          - "application"  = "atlassian"
          - "builtFrom"    = "hmcts/atlassian-infrastructure"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null
    }

Plan: 0 to add, 3 to change, 11 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":99,"Program":"tfcmt","SHA1":"","Target":"prod_general - TerraformPlanApply","Vars":{}} -->